
export const roles = {
  Werewolf: {
    className: "role-bad",
    ability: "ตอนกลางคืน 🌑 \nทุกๆคืนสามารถเลือก 1 คนเพื่อฆ่า 🩸",
  },
  Villager: {
    className: "role-good",
    ability: "เป็นเเค่ชาวบ้านตาดำๆ รอหมาป่ามากิน 💀",
  },
  Seer: {
    className: "role-good",
    ability: "ตอนกลางคืน 🌑 \nทุกๆคืนสามารถเลือก 1 คนเพื่อตรวจสอบ 🔮\nถ้า 👍 แปลว่าอยู่ทีมเดียวกันกับชาวบ้าน\nถ้า 👎 แปลว่าอยู่คนละทีมกับชาวบ้าน ",
  },
  Joker: {
    className: "role-special",
    ability: "ไม่มีทีม 🤡 \nจะชนะได้ก็ต่อเมื่อถูกโหวตให้โดนแขวน 😵",
  },
  Detective: {
    className: "role-good",
    ability: "ตอนกลางคืน 🌑 \nทุกๆคืนสามารถเลือก 2 คนเพื่อตรวจสอบ 🔍\nถ้า 👍 แปลว่าทั้ง 2 คนอยู่ทีมเดียวกัน\nถ้า 👎 แปลว่าทั้ง 2 คนอยู่คนละทีม",
  },
  Gaurd: {
    className: "role-good",
    ability: "ตอนกลางคืน 🌑 \nทุกๆคืนสามารถเลือก 1 คนเพื่อป้องกัน 🛡️ \n❌ ห้ามเลิอกซ้ำกับคืนที่ผ่านมา",
  },
  Hunter: {
    className: "role-good",
    ability: "เมื่อตาย 🩸\nสามารถเลือก 1 คนเพื่อฆ่าได้ 💥",
  },
  Sheriff: {
    className: "role-good",
    ability: "ตอนกลางวัน ☀️\nสามารถใช้ได้ 1 ครั้ง เลือก 1 คนเพื่อฆ่า 💥\n❗ถ้าคนที่ถูกฆ่าเป็นชาวบ้าน Sheriff จะตายด้วย 😵",
  },
  Wolfcub: {
    className: "role-bad",
    ability: "เมื่อตาย 🩸\nใช้ได้ครั้งเดียวจะทำให้ทีมหมาป่าสามารถฆ่าเพิ่มได้ 1 คน 💀\n❗ถ้า Wolfcub เป็นหมาเพียงตัวเดียว จะทำถูกเปลี่ยนให้กลายเป็น Werewolf 🐺",
  },
  Cupid: {
    className: "role-good",
    ability: "ก่อนวันแรก 🌞\nเลือก 2 คนเพื่อเป็นคู่รักกัน 💗\nถ้าคู่รักคนใดคนหนึ่งตาย จะต้องตายทั้งคู่ 💔",
  },
  Strongman: {
    className: "role-good",
    ability: "ตอนกลางคืน 🌑 \nถ้าถูกฆ่า จะไปตายในคืนถัดไป 😵",
  },
  Silent: {
    className: "role-good",
    ability: "ตอนกลางคืน 🌑 \nเลือก 1 คนเพื่อใบ้ 🔇",
  },
  Priest: {
    className: "role-good",
    ability: "ตอนกลางคืน 🌑 \nถ้าโดนหมาป่าฆ่า 🩸 \nจะทำให้คืนถัดไปหมาป่าไม่สามารถฆ่าใครได้ ❌",
  },
  Nakron_guy: {
    className: "role-good",
    ability: "ตอนกลางวัน ☀️ \nใช้ได้ครั้งเดียว ถ้าใครสงสัยคุณ ❓\nคุณสามารถหยิบปืนเพื่อยิงเขาได้เลย 💥",
  },
  Serial_killer: {
    className: "role-special",
    ability: "ตอนกลางคืน 🌑\nทุกๆคืนสามารถเลือก 1 คนเพื่อฆ่า 🔪\n❗ถ้าเริ่มวันใหม่เเล้วคนที่คุณเลือกฆ่าไม่ตาย \nคุณจะตายเอง 😵",
  },
  Wolf_Hunter: {
    className: "role-good",
    ability: "ตอนกลางคืน 🌑\nถ้าคุณถูกฆ่าโดยหมาป่า 🩸\nจะสุ่มหมาป่า 1 ตัวตายตามคุณไปด้วย 😵",
  },
  Wolf_Witch: {
    className: "role-bad",
    ability: "ตอนกลางคืน 🌑\nทุกๆคืนสามารถเลือก 1 คนเพื่อตรวจสอบ 🔮\nถ้า 👍 แปลว่าคนที่คุณเช็คเป็น Seer หรือ Detective\nถ้า 👎 แปลว่าไม่ใช่ Seer หรือ Detective\n❗ถ้า Wolf Witch เป็นหมาเพียงตัวเดียว จะทำถูกเปลี่ยนให้กลายเป็น Werewolf 🐺",
  },
  Wolf_Leader: {
    className: "role-bad",
    ability: "ตอนกลางคืน 🌑\nถ้าถูกตรวจสอบโดย Seer 🔮\nSeer จะเห็นเป็นฝั่งชาวบ้าน 👍",
  },
};

export const roleAbility = (role) => {
  return roleAbilityMap[role];
};

export const getRoleClass = (role) =>
  roles[role]?.className;

export const getRoleAbility = (role) =>
  roles[role]?.ability;
